In [1]:
import pandas as pd
import os

# 设置工作目录
os.chdir(r'E:\【ML_DL】\【服装项目】\dataset\data_full\sale\sale')
file_chdir=os.getcwd()

In [2]:
filecsv_list=[]
for root,dirs,files in os.walk(file_chdir):
    for file in files:
        if os.path.splitext(file)[1]=='.csv':
            filecsv_list.append(file)

In [3]:
data=pd.DataFrame()

In [4]:
for csv in filecsv_list:
    data=data.append(pd.read_csv(csv,header=0,sep=None))

D:\Install\Anaconda3_5.2.0\envs\tensorflow\lib\site-packages\ipykernel_launcher.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support sep=None with delim_whitespace=False; you can avoid this warning by specifying engine='python'.

##### data是总数据

In [5]:
data[:5]

,sale_no,sale_date,channel_id,sale_price,sku_id,Quantity
0,KOB0700394,1900/01/01 00:00:00.000000000,GS01SH10,854.0,285819001501#501#00#XL,1.0
0,KGS0000013,2008/03/25 00:00:00.000000000,SH01SH07,179.0,0818040230237#0237#00#L,1.0
1,KGS0000013,2008/03/25 00:00:00.000000000,SH01SH07,299.0,0819050040701#0701#00#XS,1.0
2,KGS0000156,2008/03/18 00:00:00.000000000,SH01SH07,499.0,0818070021101#1101#32#33,1.0
3,KGS0001224,2008/03/12 00:00:00.000000000,SH01SH05,459.0,0818070021101#1101#30#30,-1.0

In [6]:
len(data)

4199366

##### 保存初步的原始数据

In [7]:
os.chdir(r'E:\【ML_DL】\【服装项目】\dataset\data_full\sale')

In [8]:
data.to_csv('sale_all.csv')

In [9]:
len(data)

4199366

In [10]:
data[:5]

,sale_no,sale_date,channel_id,sale_price,sku_id,Quantity
0,KOB0700394,1900/01/01 00:00:00.000000000,GS01SH10,854.0,285819001501#501#00#XL,1.0
0,KGS0000013,2008/03/25 00:00:00.000000000,SH01SH07,179.0,0818040230237#0237#00#L,1.0
1,KGS0000013,2008/03/25 00:00:00.000000000,SH01SH07,299.0,0819050040701#0701#00#XS,1.0
2,KGS0000156,2008/03/18 00:00:00.000000000,SH01SH07,499.0,0818070021101#1101#32#33,1.0
3,KGS0001224,2008/03/12 00:00:00.000000000,SH01SH05,459.0,0818070021101#1101#30#30,-1.0

##### 数据清洗

In [11]:
data = data[(data.Quantity>0)&(data.sale_price>0)]

In [12]:
len(data)

3662232

In [13]:
data = data.dropna(axis = 0)

In [14]:
len(data)

3662232

##### 将有问题的sale_date进行处理，仅保留 年份/月份/日期 格式

In [15]:
df1=data

In [16]:
df1[:5]

,sale_no,sale_date,channel_id,sale_price,sku_id,Quantity
0,KOB0700394,1900/01/01 00:00:00.000000000,GS01SH10,854.0,285819001501#501#00#XL,1.0
0,KGS0000013,2008/03/25 00:00:00.000000000,SH01SH07,179.0,0818040230237#0237#00#L,1.0
1,KGS0000013,2008/03/25 00:00:00.000000000,SH01SH07,299.0,0819050040701#0701#00#XS,1.0
2,KGS0000156,2008/03/18 00:00:00.000000000,SH01SH07,499.0,0818070021101#1101#32#33,1.0
6,KGS0001723,2008/03/20 00:00:00.000000000,SH01SH07,92.0,0728040040002#0002#00#L,1.0

In [17]:
df2 = df1['sale_date'].str.split(' 00:00:',expand=True) #按","进行切分

In [18]:
df2[:5]

            0             1
0  1900/01/01  00.000000000
0  2008/03/25  00.000000000
1  2008/03/25  00.000000000
2  2008/03/18  00.000000000
6  2008/03/20  00.000000000

In [19]:
sale_Date=df2.iloc[:,0]

In [20]:
sale_Date[:5]

0    1900/01/01
0    2008/03/25
1    2008/03/25
2    2008/03/18
6    2008/03/20
Name: 0, dtype: object

In [21]:
df1=df1.drop(['sale_date'],axis=1)

In [22]:
df1[:5]

      sale_no channel_id  sale_price                    sku_id  Quantity
0  KOB0700394   GS01SH10       854.0    285819001501#501#00#XL       1.0
0  KGS0000013   SH01SH07       179.0   0818040230237#0237#00#L       1.0
1  KGS0000013   SH01SH07       299.0  0819050040701#0701#00#XS       1.0
2  KGS0000156   SH01SH07       499.0  0818070021101#1101#32#33       1.0
6  KGS0001723   SH01SH07        92.0   0728040040002#0002#00#L       1.0

In [23]:
df1['sale_date']=sale_Date

In [24]:
df1[:5]

,sale_no,channel_id,sale_price,sku_id,Quantity,sale_date
0,KOB0700394,GS01SH10,854.0,285819001501#501#00#XL,1.0,1900/01/01
0,KGS0000013,SH01SH07,179.0,0818040230237#0237#00#L,1.0,2008/03/25
1,KGS0000013,SH01SH07,299.0,0819050040701#0701#00#XS,1.0,2008/03/25
2,KGS0000156,SH01SH07,499.0,0818070021101#1101#32#33,1.0,2008/03/18
6,KGS0001723,SH01SH07,92.0,0728040040002#0002#00#L,1.0,2008/03/20

In [25]:
df3=df1

In [26]:
df3[:5]

,sale_no,channel_id,sale_price,sku_id,Quantity,sale_date
0,KOB0700394,GS01SH10,854.0,285819001501#501#00#XL,1.0,1900/01/01
0,KGS0000013,SH01SH07,179.0,0818040230237#0237#00#L,1.0,2008/03/25
1,KGS0000013,SH01SH07,299.0,0819050040701#0701#00#XS,1.0,2008/03/25
2,KGS0000156,SH01SH07,499.0,0818070021101#1101#32#33,1.0,2008/03/18
6,KGS0001723,SH01SH07,92.0,0728040040002#0002#00#L,1.0,2008/03/20

In [27]:
df4 = df3['sale_date'].str.split('/',expand=True) #按","进行切分

In [28]:
df4[:5]

      0   1   2
0  1900  01  01
0  2008  03  25
1  2008  03  25
2  2008  03  18
6  2008  03  20

In [29]:
df3['sale_date_year']=df4.iloc[:,0]

In [30]:
df3['sale_date_month']=df4.iloc[:,1]

In [31]:
df3[:5]

,sale_no,channel_id,sale_price,sku_id,Quantity,sale_date,sale_date_year,sale_date_month
0,KOB0700394,GS01SH10,854.0,285819001501#501#00#XL,1.0,1900/01/01,1900,01
0,KGS0000013,SH01SH07,179.0,0818040230237#0237#00#L,1.0,2008/03/25,2008,03
1,KGS0000013,SH01SH07,299.0,0819050040701#0701#00#XS,1.0,2008/03/25,2008,03
2,KGS0000156,SH01SH07,499.0,0818070021101#1101#32#33,1.0,2008/03/18,2008,03
6,KGS0001723,SH01SH07,92.0,0728040040002#0002#00#L,1.0,2008/03/20,2008,03

##### 只保留2008-2018年的数据

In [32]:
len(df3)

3662232

In [35]:
df3.sale_date_year=df3.sale_date_year.astype(int)

In [36]:
df = df3[(df3.sale_date_year>=2008)&(df3.sale_date_year<=2018)]

In [37]:
len(df)

3662231

##### 保存新的数据

In [38]:
df.to_csv('data_01.csv')